// Реализовать алгоритм сортировки слиянием(метод взять из Интернета)
// Пусть дан произвольный список целых чисел, удалить из него четные числа
// Задан целочисленный список ArrayList. Найти минимальное, максимальное и среднее из этого списка.
import java.util.ArrayList;

import PackForTask2.*;
import PackForTask3.*;
import PackForTask1.*;


public class App {
    public static void main(String[] args) throws Exception {
        //раскоментить нужное
        //task 2
        //ArrayList<Integer> arr2=PackForTask2.methods.GetIntArray(15, 20);
        // System.out.println(arr2);
        // PackForTask2.methods.DeleteEvenNumbers(arr2);
        // System.out.println(arr2);//task 2 is ready
        
        //task 3
        // ArrayList<Integer> arr3=PackForTask2.methods.GetIntArray(10, 50);
        // System.out.println(arr3);
        // System.out.println(PackForTask3.methods.AverageValue(arr3));
        // System.out.println(PackForTask3.methods.MaxValue(arr3));
        // System.out.println(PackForTask3.methods.MinValue(arr3));//task3 is ready
        
        // task 1
        // ArrayList<Integer> arr1=PackForTask2.methods.GetIntArray(15, 20);
        // System.out.println(arr1);
        // PackForTask1.methods.MergeSort(arr1);
        // System.out.print(arr1);//



    }
}
